Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/adc.h
#define ADC_EOC_IDR_EOC_Pos                   _UINT32_(0)                                          /* (ADC_EOC_IDR Position) End of Conversion Interrupt Disable 7 */
#define ADC_EOC_IDR_EOC_Msk                   (_UINT32_(0xFF) << ADC_EOC_IDR_EOC_Pos)              /* (ADC_EOC_IDR Mask) EOC */
#define ADC_EOC_IDR_EOC(value)                (ADC_EOC_IDR_EOC_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC_Pos)) 

/* -------- ADC_EOC_IMR : (ADC Offset: 0x3C) ( R/ 32) End Of Conversion Interrupt Mask Register -------- */
#define ADC_EOC_IMR_EOC0_Pos                  _UINT32_(0)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 0 Position */
#define ADC_EOC_IMR_EOC0_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC0_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define ADC_EOC_IMR_EOC0(value)               (ADC_EOC_IMR_EOC0_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC1_Pos                  _UINT32_(1)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 1 Position */
#define ADC_EOC_IMR_EOC1_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC1_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define ADC_EOC_IMR_EOC1(value)               (ADC_EOC_IMR_EOC1_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC2_Pos                  _UINT32_(2)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 2 Position */
#define ADC_EOC_IMR_EOC2_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC2_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define ADC_EOC_IMR_EOC2(value)               (ADC_EOC_IMR_EOC2_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC3_Pos                  _UINT32_(3)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 3 Position */
#define ADC_EOC_IMR_EOC3_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC3_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define ADC_EOC_IMR_EOC3(value)               (ADC_EOC_IMR_EOC3_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC4_Pos                  _UINT32_(4)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 4 Position */
#define ADC_EOC_IMR_EOC4_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC4_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define ADC_EOC_IMR_EOC4(value)               (ADC_EOC_IMR_EOC4_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC5_Pos                  _UINT32_(5)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 5 Position */
#define ADC_EOC_IMR_EOC5_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC5_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define ADC_EOC_IMR_EOC5(value)               (ADC_EOC_IMR_EOC5_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC6_Pos                  _UINT32_(6)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 6 Position */
#define ADC_EOC_IMR_EOC6_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC6_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define ADC_EOC_IMR_EOC6(value)               (ADC_EOC_IMR_EOC6_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_EOC7_Pos                  _UINT32_(7)                                          /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 7 Position */
#define ADC_EOC_IMR_EOC7_Msk                  (_UINT32_(0x1) << ADC_EOC_IMR_EOC7_Pos)              /* (ADC_EOC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define ADC_EOC_IMR_EOC7(value)               (ADC_EOC_IMR_EOC7_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_EOC_IMR register */
#define ADC_EOC_IMR_Msk                       _UINT32_(0x000000FF)                                 /* (ADC_EOC_IMR) Register Mask  */

#define ADC_EOC_IMR_EOC_Pos                   _UINT32_(0)                                          /* (ADC_EOC_IMR Position) End of Conversion Interrupt Mask 7 */
#define ADC_EOC_IMR_EOC_Msk                   (_UINT32_(0xFF) << ADC_EOC_IMR_EOC_Pos)              /* (ADC_EOC_IMR Mask) EOC */
#define ADC_EOC_IMR_EOC(value)                (ADC_EOC_IMR_EOC_Msk & (_UINT32_(value) << ADC_EOC_IMR_EOC_Pos)) 

/* -------- ADC_EOC_ISR : (ADC Offset: 0x40) ( R/ 32) End Of Conversion Interrupt Status Register -------- */
#define ADC_EOC_ISR_EOC0_Pos                  _UINT32_(0)                                          /* (ADC_EOC_ISR) End of Conversion 0 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC0_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC0_Pos)              /* (ADC_EOC_ISR) End of Conversion 0 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC0(value)               (ADC_EOC_ISR_EOC0_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC1_Pos                  _UINT32_(1)                                          /* (ADC_EOC_ISR) End of Conversion 1 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC1_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC1_Pos)              /* (ADC_EOC_ISR) End of Conversion 1 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC1(value)               (ADC_EOC_ISR_EOC1_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC2_Pos                  _UINT32_(2)                                          /* (ADC_EOC_ISR) End of Conversion 2 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC2_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC2_Pos)              /* (ADC_EOC_ISR) End of Conversion 2 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC2(value)               (ADC_EOC_ISR_EOC2_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC3_Pos                  _UINT32_(3)                                          /* (ADC_EOC_ISR) End of Conversion 3 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC3_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC3_Pos)              /* (ADC_EOC_ISR) End of Conversion 3 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC3(value)               (ADC_EOC_ISR_EOC3_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC4_Pos                  _UINT32_(4)                                          /* (ADC_EOC_ISR) End of Conversion 4 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC4_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC4_Pos)              /* (ADC_EOC_ISR) End of Conversion 4 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC4(value)               (ADC_EOC_ISR_EOC4_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC5_Pos                  _UINT32_(5)                                          /* (ADC_EOC_ISR) End of Conversion 5 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC5_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC5_Pos)              /* (ADC_EOC_ISR) End of Conversion 5 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC5(value)               (ADC_EOC_ISR_EOC5_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC6_Pos                  _UINT32_(6)                                          /* (ADC_EOC_ISR) End of Conversion 6 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC6_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC6_Pos)              /* (ADC_EOC_ISR) End of Conversion 6 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC6(value)               (ADC_EOC_ISR_EOC6_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_EOC7_Pos                  _UINT32_(7)                                          /* (ADC_EOC_ISR) End of Conversion 7 (automatically set / cleared) Position */
#define ADC_EOC_ISR_EOC7_Msk                  (_UINT32_(0x1) << ADC_EOC_ISR_EOC7_Pos)              /* (ADC_EOC_ISR) End of Conversion 7 (automatically set / cleared) Mask */
#define ADC_EOC_ISR_EOC7(value)               (ADC_EOC_ISR_EOC7_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_EOC_ISR register */
#define ADC_EOC_ISR_Msk                       _UINT32_(0x000000FF)                                 /* (ADC_EOC_ISR) Register Mask  */

#define ADC_EOC_ISR_EOC_Pos                   _UINT32_(0)                                          /* (ADC_EOC_ISR Position) End of Conversion 7 (automatically set / cleared) */
#define ADC_EOC_ISR_EOC_Msk                   (_UINT32_(0xFF) << ADC_EOC_ISR_EOC_Pos)              /* (ADC_EOC_ISR Mask) EOC */
#define ADC_EOC_ISR_EOC(value)                (ADC_EOC_ISR_EOC_Msk & (_UINT32_(value) << ADC_EOC_ISR_EOC_Pos)) 

/* -------- ADC_TEMPMR : (ADC Offset: 0x44) (R/W 32) Temperature Sensor Mode Register -------- */
#define ADC_TEMPMR_TEMPON_Pos                 _UINT32_(0)                                          /* (ADC_TEMPMR) Temperature Sensor On Position */
#define ADC_TEMPMR_TEMPON_Msk                 (_UINT32_(0x1) << ADC_TEMPMR_TEMPON_Pos)             /* (ADC_TEMPMR) Temperature Sensor On Mask */
#define ADC_TEMPMR_TEMPON(value)              (ADC_TEMPMR_TEMPON_Msk & (_UINT32_(value) << ADC_TEMPMR_TEMPON_Pos)) /* Assigment of value for TEMPON in the ADC_TEMPMR register */
#define ADC_TEMPMR_TEMPCMPMOD_Pos             _UINT32_(4)                                          /* (ADC_TEMPMR) Temperature Comparison Mode Position */
#define ADC_TEMPMR_TEMPCMPMOD_Msk             (_UINT32_(0x3) << ADC_TEMPMR_TEMPCMPMOD_Pos)         /* (ADC_TEMPMR) Temperature Comparison Mode Mask */
#define ADC_TEMPMR_TEMPCMPMOD(value)          (ADC_TEMPMR_TEMPCMPMOD_Msk & (_UINT32_(value) << ADC_TEMPMR_TEMPCMPMOD_Pos)) /* Assigment of value for TEMPCMPMOD in the ADC_TEMPMR register */
#define   ADC_TEMPMR_TEMPCMPMOD_LOW_Val       _UINT32_(0x0)                                        /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window.  */
#define   ADC_TEMPMR_TEMPCMPMOD_HIGH_Val      _UINT32_(0x1)                                        /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window.  */
#define   ADC_TEMPMR_TEMPCMPMOD_IN_Val        _UINT32_(0x2)                                        /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is in the comparison window.  */
#define   ADC_TEMPMR_TEMPCMPMOD_OUT_Val       _UINT32_(0x3)                                        /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is out of the comparison window.  */
#define ADC_TEMPMR_TEMPCMPMOD_LOW             (ADC_TEMPMR_TEMPCMPMOD_LOW_Val << ADC_TEMPMR_TEMPCMPMOD_Pos) /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window. Position  */
#define ADC_TEMPMR_TEMPCMPMOD_HIGH            (ADC_TEMPMR_TEMPCMPMOD_HIGH_Val << ADC_TEMPMR_TEMPCMPMOD_Pos) /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window. Position  */
#define ADC_TEMPMR_TEMPCMPMOD_IN              (ADC_TEMPMR_TEMPCMPMOD_IN_Val << ADC_TEMPMR_TEMPCMPMOD_Pos) /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is in the comparison window. Position  */
#define ADC_TEMPMR_TEMPCMPMOD_OUT             (ADC_TEMPMR_TEMPCMPMOD_OUT_Val << ADC_TEMPMR_TEMPCMPMOD_Pos) /* (ADC_TEMPMR) Generates the TEMPCHG flag in ADC_ISR when the converted data is out of the comparison window. Position  */
#define ADC_TEMPMR_Msk                        _UINT32_(0x00000031)                                 /* (ADC_TEMPMR) Register Mask  */


/* -------- ADC_TEMPCWR : (ADC Offset: 0x48) (R/W 32) Temperature Compare Window Register -------- */
#define ADC_TEMPCWR_TLOWTHRES_Pos             _UINT32_(0)                                          /* (ADC_TEMPCWR) Temperature Low Threshold Position */
#define ADC_TEMPCWR_TLOWTHRES_Msk             (_UINT32_(0xFFF) << ADC_TEMPCWR_TLOWTHRES_Pos)       /* (ADC_TEMPCWR) Temperature Low Threshold Mask */
#define ADC_TEMPCWR_TLOWTHRES(value)          (ADC_TEMPCWR_TLOWTHRES_Msk & (_UINT32_(value) << ADC_TEMPCWR_TLOWTHRES_Pos)) /* Assigment of value for TLOWTHRES in the ADC_TEMPCWR register */
#define ADC_TEMPCWR_THIGHTHRES_Pos            _UINT32_(16)                                         /* (ADC_TEMPCWR) Temperature High Threshold Position */
#define ADC_TEMPCWR_THIGHTHRES_Msk            (_UINT32_(0xFFF) << ADC_TEMPCWR_THIGHTHRES_Pos)      /* (ADC_TEMPCWR) Temperature High Threshold Mask */
#define ADC_TEMPCWR_THIGHTHRES(value)         (ADC_TEMPCWR_THIGHTHRES_Msk & (_UINT32_(value) << ADC_TEMPCWR_THIGHTHRES_Pos)) /* Assigment of value for THIGHTHRES in the ADC_TEMPCWR register */
#define ADC_TEMPCWR_Msk                       _UINT32_(0x0FFF0FFF)                                 /* (ADC_TEMPCWR) Register Mask  */


