Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/adc.h
/* -------- ADC_RNCR : (ADC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define ADC_RNCR_RXNCTR_Pos                   _UINT32_(0)                                          /* (ADC_RNCR) Receive Next Counter Position */
#define ADC_RNCR_RXNCTR_Msk                   (_UINT32_(0xFFFF) << ADC_RNCR_RXNCTR_Pos)            /* (ADC_RNCR) Receive Next Counter Mask */
#define ADC_RNCR_RXNCTR(value)                (ADC_RNCR_RXNCTR_Msk & (_UINT32_(value) << ADC_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the ADC_RNCR register */
#define ADC_RNCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (ADC_RNCR) Register Mask  */


/* -------- ADC_PTCR : (ADC Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define ADC_PTCR_RXTEN_Pos                    _UINT32_(0)                                          /* (ADC_PTCR) Receiver Transfer Enable Position */
#define ADC_PTCR_RXTEN_Msk                    (_UINT32_(0x1) << ADC_PTCR_RXTEN_Pos)                /* (ADC_PTCR) Receiver Transfer Enable Mask */
#define ADC_PTCR_RXTEN(value)                 (ADC_PTCR_RXTEN_Msk & (_UINT32_(value) << ADC_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the ADC_PTCR register */
#define ADC_PTCR_RXTDIS_Pos                   _UINT32_(1)                                          /* (ADC_PTCR) Receiver Transfer Disable Position */
#define ADC_PTCR_RXTDIS_Msk                   (_UINT32_(0x1) << ADC_PTCR_RXTDIS_Pos)               /* (ADC_PTCR) Receiver Transfer Disable Mask */
#define ADC_PTCR_RXTDIS(value)                (ADC_PTCR_RXTDIS_Msk & (_UINT32_(value) << ADC_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the ADC_PTCR register */
#define ADC_PTCR_TXTEN_Pos                    _UINT32_(8)                                          /* (ADC_PTCR) Transmitter Transfer Enable Position */
#define ADC_PTCR_TXTEN_Msk                    (_UINT32_(0x1) << ADC_PTCR_TXTEN_Pos)                /* (ADC_PTCR) Transmitter Transfer Enable Mask */
#define ADC_PTCR_TXTEN(value)                 (ADC_PTCR_TXTEN_Msk & (_UINT32_(value) << ADC_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the ADC_PTCR register */
#define ADC_PTCR_TXTDIS_Pos                   _UINT32_(9)                                          /* (ADC_PTCR) Transmitter Transfer Disable Position */
#define ADC_PTCR_TXTDIS_Msk                   (_UINT32_(0x1) << ADC_PTCR_TXTDIS_Pos)               /* (ADC_PTCR) Transmitter Transfer Disable Mask */
#define ADC_PTCR_TXTDIS(value)                (ADC_PTCR_TXTDIS_Msk & (_UINT32_(value) << ADC_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the ADC_PTCR register */
#define ADC_PTCR_RXCBEN_Pos                   _UINT32_(16)                                         /* (ADC_PTCR) Receiver Circular Buffer Enable Position */
#define ADC_PTCR_RXCBEN_Msk                   (_UINT32_(0x1) << ADC_PTCR_RXCBEN_Pos)               /* (ADC_PTCR) Receiver Circular Buffer Enable Mask */
#define ADC_PTCR_RXCBEN(value)                (ADC_PTCR_RXCBEN_Msk & (_UINT32_(value) << ADC_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the ADC_PTCR register */
#define ADC_PTCR_RXCBDIS_Pos                  _UINT32_(17)                                         /* (ADC_PTCR) Receiver Circular Buffer Disable Position */
#define ADC_PTCR_RXCBDIS_Msk                  (_UINT32_(0x1) << ADC_PTCR_RXCBDIS_Pos)              /* (ADC_PTCR) Receiver Circular Buffer Disable Mask */
#define ADC_PTCR_RXCBDIS(value)               (ADC_PTCR_RXCBDIS_Msk & (_UINT32_(value) << ADC_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the ADC_PTCR register */
#define ADC_PTCR_TXCBEN_Pos                   _UINT32_(18)                                         /* (ADC_PTCR) Transmitter Circular Buffer Enable Position */
#define ADC_PTCR_TXCBEN_Msk                   (_UINT32_(0x1) << ADC_PTCR_TXCBEN_Pos)               /* (ADC_PTCR) Transmitter Circular Buffer Enable Mask */
#define ADC_PTCR_TXCBEN(value)                (ADC_PTCR_TXCBEN_Msk & (_UINT32_(value) << ADC_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the ADC_PTCR register */
#define ADC_PTCR_TXCBDIS_Pos                  _UINT32_(19)                                         /* (ADC_PTCR) Transmitter Circular Buffer Disable Position */
#define ADC_PTCR_TXCBDIS_Msk                  (_UINT32_(0x1) << ADC_PTCR_TXCBDIS_Pos)              /* (ADC_PTCR) Transmitter Circular Buffer Disable Mask */
#define ADC_PTCR_TXCBDIS(value)               (ADC_PTCR_TXCBDIS_Msk & (_UINT32_(value) << ADC_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the ADC_PTCR register */
#define ADC_PTCR_ERRCLR_Pos                   _UINT32_(24)                                         /* (ADC_PTCR) Transfer Bus Error Clear Position */
#define ADC_PTCR_ERRCLR_Msk                   (_UINT32_(0x1) << ADC_PTCR_ERRCLR_Pos)               /* (ADC_PTCR) Transfer Bus Error Clear Mask */
#define ADC_PTCR_ERRCLR(value)                (ADC_PTCR_ERRCLR_Msk & (_UINT32_(value) << ADC_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the ADC_PTCR register */
#define ADC_PTCR_Msk                          _UINT32_(0x010F0303)                                 /* (ADC_PTCR) Register Mask  */


/* -------- ADC_PTSR : (ADC Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define ADC_PTSR_RXTEN_Pos                    _UINT32_(0)                                          /* (ADC_PTSR) Receiver Transfer Enable Position */
#define ADC_PTSR_RXTEN_Msk                    (_UINT32_(0x1) << ADC_PTSR_RXTEN_Pos)                /* (ADC_PTSR) Receiver Transfer Enable Mask */
#define ADC_PTSR_RXTEN(value)                 (ADC_PTSR_RXTEN_Msk & (_UINT32_(value) << ADC_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the ADC_PTSR register */
#define ADC_PTSR_TXTEN_Pos                    _UINT32_(8)                                          /* (ADC_PTSR) Transmitter Transfer Enable Position */
#define ADC_PTSR_TXTEN_Msk                    (_UINT32_(0x1) << ADC_PTSR_TXTEN_Pos)                /* (ADC_PTSR) Transmitter Transfer Enable Mask */
#define ADC_PTSR_TXTEN(value)                 (ADC_PTSR_TXTEN_Msk & (_UINT32_(value) << ADC_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the ADC_PTSR register */
#define ADC_PTSR_RXCBEN_Pos                   _UINT32_(16)                                         /* (ADC_PTSR) Receiver Circular Buffer Enable Position */
#define ADC_PTSR_RXCBEN_Msk                   (_UINT32_(0x1) << ADC_PTSR_RXCBEN_Pos)               /* (ADC_PTSR) Receiver Circular Buffer Enable Mask */
#define ADC_PTSR_RXCBEN(value)                (ADC_PTSR_RXCBEN_Msk & (_UINT32_(value) << ADC_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the ADC_PTSR register */
#define ADC_PTSR_TXCBEN_Pos                   _UINT32_(18)                                         /* (ADC_PTSR) Transmitter Circular Buffer Enable Position */
#define ADC_PTSR_TXCBEN_Msk                   (_UINT32_(0x1) << ADC_PTSR_TXCBEN_Pos)               /* (ADC_PTSR) Transmitter Circular Buffer Enable Mask */
#define ADC_PTSR_TXCBEN(value)                (ADC_PTSR_TXCBEN_Msk & (_UINT32_(value) << ADC_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the ADC_PTSR register */
#define ADC_PTSR_ERR_Pos                      _UINT32_(24)                                         /* (ADC_PTSR) Transfer Bus Error Position */
#define ADC_PTSR_ERR_Msk                      (_UINT32_(0x1) << ADC_PTSR_ERR_Pos)                  /* (ADC_PTSR) Transfer Bus Error Mask */
#define ADC_PTSR_ERR(value)                   (ADC_PTSR_ERR_Msk & (_UINT32_(value) << ADC_PTSR_ERR_Pos)) /* Assigment of value for ERR in the ADC_PTSR register */
#define ADC_PTSR_Msk                          _UINT32_(0x01050101)                                 /* (ADC_PTSR) Register Mask  */


/* -------- ADC_PWPMR : (ADC Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define ADC_PWPMR_WPPTREN_Pos                 _UINT32_(0)                                          /* (ADC_PWPMR) Write Protection Pointer Registers Enable Position */
#define ADC_PWPMR_WPPTREN_Msk                 (_UINT32_(0x1) << ADC_PWPMR_WPPTREN_Pos)             /* (ADC_PWPMR) Write Protection Pointer Registers Enable Mask */
#define ADC_PWPMR_WPPTREN(value)              (ADC_PWPMR_WPPTREN_Msk & (_UINT32_(value) << ADC_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the ADC_PWPMR register */
#define ADC_PWPMR_WPCTREN_Pos                 _UINT32_(1)                                          /* (ADC_PWPMR) Write Protection Counter Registers Enable Position */
#define ADC_PWPMR_WPCTREN_Msk                 (_UINT32_(0x1) << ADC_PWPMR_WPCTREN_Pos)             /* (ADC_PWPMR) Write Protection Counter Registers Enable Mask */
#define ADC_PWPMR_WPCTREN(value)              (ADC_PWPMR_WPCTREN_Msk & (_UINT32_(value) << ADC_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the ADC_PWPMR register */
#define ADC_PWPMR_WPCREN_Pos                  _UINT32_(2)                                          /* (ADC_PWPMR) Write Protection Control Register Enable Position */
#define ADC_PWPMR_WPCREN_Msk                  (_UINT32_(0x1) << ADC_PWPMR_WPCREN_Pos)              /* (ADC_PWPMR) Write Protection Control Register Enable Mask */
#define ADC_PWPMR_WPCREN(value)               (ADC_PWPMR_WPCREN_Msk & (_UINT32_(value) << ADC_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the ADC_PWPMR register */
#define ADC_PWPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (ADC_PWPMR) Write Protection Key Position */
#define ADC_PWPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << ADC_PWPMR_WPKEY_Pos)          /* (ADC_PWPMR) Write Protection Key Mask */
#define ADC_PWPMR_WPKEY(value)                (ADC_PWPMR_WPKEY_Msk & (_UINT32_(value) << ADC_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the ADC_PWPMR register */
#define   ADC_PWPMR_WPKEY_PASSWD_Val          _UINT32_(0x504443)                                   /* (ADC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define ADC_PWPMR_WPKEY_PASSWD                (ADC_PWPMR_WPKEY_PASSWD_Val << ADC_PWPMR_WPKEY_Pos)  /* (ADC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define ADC_PWPMR_Msk                         _UINT32_(0xFFFFFF07)                                 /* (ADC_PWPMR) Register Mask  */


